import React, { Component } from 'react'
import PropTypes from 'prop-types'
import { Link } from "react-router-dom";
import {Card,Button} from 'react-bootstrap';
export default class Tailbar extends Component {
    static propTypes = {
        prop: PropTypes
    }

    render() {
        return (
            <div>
                <Card className="bg-secondary text-white">
  <Card.Header as="h5">Заавар</Card.Header>
  <Card.Body>
    <Card.Title>Толийг хэрхэн ашиглах тухай</Card.Title>
    <Card.Text>
   1. Үг хайх зурваст нөхцөлөөр хувилсан үг бичиж болох ба зөв бичгийн дүрмийн дагуу үгийг задалж боломжит бүх хувилбарыг харуулна.<br/>
   2. Толгой үгийг олоход тухайн толгой үгийн товч утга болон бүх хувиллыг үзэж болно.<br/>
3. Толгой үгийн хэрэглээг идэвхтэй (●●●), харьцангуй идэвхтэй (●●○), идэвхгүй (●○○) гэж ялган дугуйг улаан өнгөөр будаж тэмдэглэсэн нь үгийн утга, хэрэглээг эзэмших, сургалтад ашиглахад тустай юм.<br/>
4. Толгой үгийн нэр үгийг I, үйл үгийг II гэсэн ром тоогоор, арын 1.1, 1.2, 1.3 гэсэн араб тоогоор хэл зүйн хувиллын дүрмийг дугаарлаж заасан болно.<br/>
5. Толгой үгийн хэл зүйн ангиллыг Ерөнхий боловсролын сургуулийн сургалтад мөрдөж байгаа<br/>
жинхэнэ нэр [ж.н],<br/>
үйл үг [үй.ү],<br/>
тэмдэг нэр [тэ.н],<br/>
тооны нэр [то.н],<br/>
төлөөний үг [тө.ү],<br/>
орны нэр [о.н],<br/>
цагийн нэр [ц.н],<br/>
холбох үг [хо.ү],<br/>
баймж үг, бүтээвэр [баймж],<br/>
дүрс дуурайх үг [д.д.ү],<br/>
авиа дуурайх үг [а.д.ү],<br/>
аялга өгүүлбэр [а.ө],<br/>
дутмаг үйл үг [дут.ү.ү]<br/>
гэж дөрвөлжин хаалтад ялган товчилж тэмдэглэв.<br/> 
6. Энэ нь уг үгийн хэл зүйн үүргийг мэдэхэд тустай юм.<br/>
7. Ижил бичлэгтэй үгсийг тусгайлан дугаарлалгүй, хэл зүйн хувиллын үүргээр нь жинхэнэ нэр [ж.н], үйл үг [үй.ү] гэж ялгахын хамт, бусад ижил үгийг хэрэглээг нь анхаарч дараалуулсан болно.<br/>
8. Толгой үгийн гол утгыг ойлгохын тулд товч тайлбар дагалдууллаа. <br/>
9. Хэрэв салаа утга илэрхийлж байгаа бол цэгтэй таслалаар (;) ялгав. <br/>
10. Толгой үгийн утгыг холбоо үгээр тайлбарлахдаа толгой үг нь давтагдаж байгаа бол долгион зураасаар (~) ялгасан болно. Жишээ нь: туш II.9.1 ●●○ [үй.ү] морь ~; садаа болох, харшлах гэх мэт.<br/>
11. Гол төлөв холбоо үгээр хэрэглэгдэх толгой үгийн дараа тодорхойлох цэг (:) тавьж товч тайлбарыг дагалдуулсан болно. Жишээ нь: тулгарт ●○○ [ж.н] ~ малгай: ёслолын малгай гэх мэт.<br/>
12. Ихэнхдээ нэр томьёоны үүрэгтэй амьтан, ургамлын нэрийн утгыг тодорхой болгохын үүднээс толгой үгийн ард амьтны нэрийг (амь.), ургамлын нэрийг (урга.) гэх мэтээр нуман хаалтад тэмдэглэсэн болно. Жишээ нь: голт I.1.2 ●○○ (урга.) [ж.н] нэг зүйл бут, үр нь эмд орно гэх мэт.<br/>
13. Монголжсон гадаад үгийг монгол үгийн жагсаалтад оруулсан бол шинэ тутам монгол хэлэнд орсон гадаад үгийг гадаад үг [гад.] гэсэн тэмдэглэгээ тавьж оруулсан болно. Жишээ нь: график I.27.1 [гад.] графикийн, графикт, графикийг, графикаас, графикаар, графиктай, график руу, графикаа гэх мэт.<br/>
14. Монголчлох бололцоо бүхий зарим гадаад үгийг гадаад үгийн жагсаалтад оруулалгүй орхисон тул тэдгээр үг хэллэгийг монголоор нэрлэж хэвших нь зөв юм. Жишээ нь: факультет (салбар сургууль) гэх мэт.<br/>
15. Энэ толь нь зөв бичих дүрмийн толь учраас үгийн утгад дэлгэрэнгүй тайлбар хийгээгүй бөгөөд зөвхөн уг үгийн товч утгыг толгой үгийн ард хадаж өгсөн болно.<br/>
    </Card.Text>
 <Link to={"/alph"} >  <Button  >Буцах</Button></Link> 
  </Card.Body>
</Card>
            </div>
        )
    }
}
